logic gates.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-24 Sat 15:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>composing logic gates</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css">
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Ubuntu">
</head>
<body>
<div id="content" class="content">
<h1 class="title">composing logic gates</h1>
<p>
For any gate with 1 input, we have the following skeleton of the truth table:
</p>

<pre class="example">
| 0 | a |
| 1 | b |
</pre>

<p>
The input is on the <code>y</code> axis. For each of the 0/1 input, there are multiple possibilities:
</p>

<ul class="org-ul">
<li>a -&gt; can be 0/1</li>
<li>b -&gt; can be 0/1</li>
</ul>

<p>
Hence, total: 4 possibilities.
</p>


<p>
Let's enumerate all the possible 1 input gates. Fixing the order of the inputs, we can encode the gate as: <code>ab</code>.  
Hence, <code>01</code> gate, fully expanded is:
</p>


<pre class="example">
| 0 | 0 |
| 1 | 1 |
</pre>

<p>
This is the no-op gate.  
</p>

<p>
All possible gates:
</p>

<pre class="example">
00 -&gt; always off gate
01 -&gt; no-op gate
10 -&gt; not gate
11 -&gt; always on gate
</pre>

<div id="outline-container-org65cf705" class="outline-2">
<h2 id="org65cf705">2 input gates</h2>
<div class="outline-text-2" id="text-org65cf705">
<p>
On the similar logic, we have the following truth table:
</p>

<pre class="example">
|   | 0 | 1 |
| 0 | a | b |
| 1 | c | d |
</pre>

<p>
We have input 0 on <code>y</code> axis, input 1 on <code>x</code> axis. Total possible gates: 2<sup>4</sup> = 16. Fixing the order of the input values, we can encode the gates like: <code>abcd</code>  
</p>


<p>
Enumerating all possible gates:
</p>

<pre class="example">
0001 -&gt; AND gate
0111 -&gt; OR gate
1000 -&gt; NOR gate
1001 -&gt; XNOR gate (exclusive not OR)
1110 -&gt; NAND gate
0110 -&gt; XOR gate
0010 -&gt; ?
0011 -&gt; ? input 0 output
0100 -&gt; ?
0101 -&gt; ? input 1 output
1010 -&gt; ? not input 1 gate
1011 -&gt; ?
1100 -&gt; ? not input 0 gate
1101 -&gt; ?
0000 -&gt; ? always off gate
1111 -&gt; ? always on gate
</pre>

<p>
Note, there are only a few gates that are useful. Overall, all gates can be constructed from the <code>NAND</code> gate.
</p>
</div>
</div>

<div id="outline-container-org8d16002" class="outline-2">
<h2 id="org8d16002">Combining gates</h2>
<div class="outline-text-2" id="text-org8d16002">
<p>
Consider the NAND gate (1110) which can be thought of as a function <code>NAND(inp1, inp2) -&gt; output</code>:
</p>

<pre class="example">
|   | 0 | 1 |
| 0 | 1 | 1 | NAND gate
| 1 | 1 | 0 |
</pre>

<p>
And the NOT gate (10), which is <code>NOT(inp) -&gt; output</code>:
</p>

<pre class="example">
| 0 | 1 |
| 1 | 0 | NOT gate
</pre>

<p>
Note how the <code>NOT(output)</code> function just flips each value in the truth table. We can use this to get the AND gate by composition:
<code>AND(inp1, inp2) = NOT(NAND(inp1, inp2))</code>
</p>

<pre class="example">
|   | 0 | 1 |
| 0 | 0 | 0 | AND gate
| 1 | 0 | 1 |
</pre>

<p>
Applying <code>NOT</code> to one of the inputs, say input 0 on the y axis, the result is shuffling of the 2 rows:
</p>

<pre class="example">
|   | 0 | 1 |
| 0 | a | b |
| 1 | c | d |

      ||

|   | 0 | 1 |
| 0 | c | d |
| 1 | a | b |
</pre>

<p>
Similarly, applying to input 1 on the x axis, results in shuffling of the 2 columns:
</p>

<pre class="example">
|   | 0 | 1 |
| 0 | a | b |
| 1 | c | d |

      ||

|   | 0 | 1 |
| 0 | b | a |
| 1 | d | c |
</pre>

<p>
Thus, we can get the OR gate by flipping both rows and columns: <code>OR(inp1, inp2) = NAND(NOT(inp1), NOT(inp2))</code>:
</p>

<pre class="example">
|   | 0 | 1 |
| 0 | 1 | 1 | NAND gate
| 1 | 1 | 0 |


|   | 0 | 1 |
| 0 | 0 | 1 | OR gate
| 1 | 1 | 1 |

</pre>
</div>

<div id="outline-container-orga4f759e" class="outline-3">
<h3 id="orga4f759e">Applying 2 input functions</h3>
<div class="outline-text-3" id="text-orga4f759e">
<p>
How do we get <code>XOR</code> gate by applying <code>NOT</code>? It's not possible since any amount of switching rows/columns or flipping each value in the truth table won't give us:
</p>

<pre class="example">
|   | 0 | 1 |
| 0 | 0 | 1 | XOR gate
| 1 | 1 | 0 |
</pre>

<p>
We spoke till now only of applying the <code>NOT</code> function to the input/output. What does it mean to apply the <code>AND</code> function?
</p>

<p>
It can be thought to apply pointwise on truth tables:
</p>


<pre class="example">
|   | 0 | 1 |
| 0 | a | b | 
| 1 | c | d |

      AND

|   | 0  | 1  |
| 0 | a' | b' |
| 1 | c' | d' |

       ||

|   | 0       | 1       |
| 0 | X(a+a') | X(b+b') |
| 1 | X(c+c') | X(d+d') |
</pre>
<p>
where <code>X</code> is <code>carry-bit(inp1, inp2)</code>
</p>

<p>
So, ADDing the NAND output and OR output gives us XOR:
</p>

<pre class="example">
|   | 0 | 1 |
| 0 | 1 | 1 | 
| 1 | 1 | 0 |

      AND

|   | 0 | 1 |
| 0 | 0 | 1 |
| 1 | 1 | 1 |

       ||

|   | 0 | 1 |
| 0 | 0 | 1 | XOR gate
| 1 | 1 | 0 |
</pre>

<p>
Similarly, other 2 input fucntions:
</p>

<ul class="org-ul">
<li>AND: carry-bit(inp1, inp2)</li>
<li>OR: base-bit(inp1+inp2, carry-bit(inp1, inp2))</li>
<li>NAND: not(carry-bit(inp1, inp2))</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>